Couldn't find an appropriate Host. Try selecting a different Host Face or switch Placement Mode.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotFindHost { get; }
  Visual Basic
Public Shared ReadOnly Property CannotFindHost As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotFindHost {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace